{"url":"https://en.wikipedia.org/wiki?curid=48687903","title":"Jeon Hye-jin (actress, born 1988)","body":"\nJeon Hye-jin (actress, born 1988)\n\nJeon Hye-jin (born June 17, 1988) is a South Korean actress.\nPersonal life.\nJeon married his \"Smile, You\" co-star Lee Chun-hee on March 11, 2011. Their daughter, Lee So Yu, was born on July 30, 2011.\n\n"}
{"url":"https://en.wikipedia.org/wiki?curid=48687919","title":"Benham, Indiana","body":"\nBenham, Indiana\n\nBenham is an unincorporated community in Ripley County, in the U.S. state of Indiana.\nHistory.\nAn old variant name of the community was Benhams Store. A post office opened under the name Benham Store in 1866, the name was shortened to Benham 1888, and the post office was discontinued in 1934. John Benham, Jr., served as a first postmaster.\n\n"}
{"url":"https://en.wikipedia.org/wiki?curid=48687922","title":"Hilyat al-Muttaqin","body":"\nHilyat al-Muttaqin\n\nHilyat al-Muttaqin (\"The adornment of the God-fearing\", ) is a Hadith book of Muhammad Baqir al-Majlisi. This work is written in Persian about Islamic morality, instructions and traditions.\nThe aim of writing.\nAccording to book's foreword, it was written because of a group of Muslims asked Majlisi to write a Persian book in the Islamic morality, instructions and traditions from the hadith of Ahl al-Bayt.\nDate of writing.\nAccording a manuscript, the date of writing of this work is 1671, But in another book has been mentioned to 1668-9.\nContent and chapters.\nThe book has 14 chapters about individual and collective morality and some Fiqh rulings, Duasand practices and had an extra chapter about some etiquette miscellaneous and their benefits. The titles of chapters are mentioned below:\n\n"}
{"url":"https://en.wikipedia.org/wiki?curid=48687925","title":"MK Preshow Shimray","body":"\nMK Preshow Shimray\n\nMK Preshow Shimray is the sitting MLA from 46 - Chingai (ST) Assembly Constituency in Manipur, India. He was elected under Indian National Congress ticket in 2012.\nEarly life.\nMK Preshow Shimray was born on April 5, 1966 at Poi village to MK Somi Shimray. He did his B.E and M.E (Environment) at Salem Engineering College, Tamil Nadu. After completing his education, he worked as Scientific Officer and thereafter as Senior Scientific Officer in the Environment and Ecology Department, Manipur. \nPolitical career.\nIn 2012, he resigned from his engagement as senior scientific officer in order to contest the MLA election under Congress ticket. He got elected beating his nearest rival with a simple majority vote. In July 2013, MK Preshow Shimray was elected as the Deputy Speaker of the Manipur Legislative Assembly and is still serving in that capacity.\nAssasination bids.\nOn April 30, 2013, the cavalcade of the deputy speaker was ambushed near Ukhrul by suspected NSCN (IM) cadres, however, there were no reports of casualty. The second bid on his life was made on April 9, 2014 by some rebel groups near Litan but, there too he escaped unharmed.\nAnti tribal bills protests.\nAll tribal MLAs in Manipur were requested to resign in protest against the passing of three anti tribal bills in Manipur Ligislative Assembly on 30 August 2015. However, many tribal MLAs paid no heed to the call of the tribal people for which many elected representatives were ostrcised from their respective constituencies. MK Preshow Shimray along with the sitting MLA of 44-Phungyar MLA constituency Victor Keishing (son of Rishang Keishing)were also declared anti-socials by the Tangkhul frontal organisations for failing to tender their resignation letters.\n\n"}
{"url":"https://en.wikipedia.org/wiki?curid=48687930","title":"Clinton, Ripley County, Indiana","body":"\nClinton, Ripley County, Indiana\n\nClinton is an unincorporated community in Ripley County, in the U.S. state of Indiana.\nHistory.\nClinton was founded in 1833.\n\n"}
{"url":"https://en.wikipedia.org/wiki?curid=48687935","title":"NoRMA","body":"\nNoRMA\n\nNo Remote Memory Access (abbreviated as NoRMA) is a computer memory architecture for multiprocessor systems, given its name by . In a NoRMA architecture, the address space globally is not unique and the memory is not globally accessible by the processors. Accesses to remote memory modules are only indirectly possible by messages through the interconnection network to other processors, which in turn possibly deliver the desired data in a reply message. The entire storage configuration is partitioned statically among the processors.\nThe advantage of the NoRMA model is the ability to construct extremely large configurations, which is achieved by shifting the problem to the user configuration. Programs for NoRMA architectures need to evenly partitioning the data into local memory modules, ensure consistency of software caches to enforce the desired consistency model, handle transformations of data identifiers from one processor's address space to another, and realize a message-passing system for remote access to data. The programming model of Norma architecture is therefore extremely complicated.\n\n"}
{"url":"https://en.wikipedia.org/wiki?curid=48687945","title":"National Capitol Wing Civil Air Patrol","body":"\nNational Capitol Wing Civil Air Patrol\n\nThe National Capital Wing of the Civil Air Patrol (CAP) is the highest echelon of Civil Air Patrol in the district of Washington, D.C. The National Capital Wing consists of nearly 400 cadet and adult members at over 6 locations across the district of Washington D.C.\nMission.\nThe National Capital Wing performs the three missions of the Civil Air Patrol: providing emergency services; offering cadet programs for youth; and providing aerospace education for both CAP members and the general public.\nEmergency services.\nThe Civil Air Patrol provides emergency services, which includes performing search and rescue and disaster relief missions; as well as assisting in humanitarian aid assignments. The CAP also provides Air Force support through conducting light transport, communications support, and low-altitude route surveys. The Civil Air Patrol can also offer support to counter-drug missions. \nCadet programs.\nThe Civil Air Patrol offers a cadet program for youth aged 12 to 21, which includes aerospace education, leadership training, physical fitness and moral leadership. \nAerospace education.\nThe Civil Air Patrol offers aerospace education for CAP members and the general public, including providing training to the members of CAP, and offering workshops for youth throughout the nation through schools and public aviation events. \n\n"}
{"url":"https://en.wikipedia.org/wiki?curid=48687949","title":"Bae Seong-woo","body":"\nBae Seong-woo\n\nBae Seong-woo (born November 21, 1972) is a South Korean actor. He starred in film such as \"My Love, My Bride\" (2014), \"Office\" (2015), \"\" (2015) and \"Inside Men\" (2015).\n\n"}
{"url":"https://en.wikipedia.org/wiki?curid=48687980","title":"Cross Roads, Ripley County, Indiana","body":"\nCross Roads, Ripley County, Indiana\n\nCross Roads is an unincorporated community in Ripley County, in the U.S. state of Indiana.\nHistory.\nThe community was so named for the fact it originally contained a store at a crossroads.\n\n"}
{"url":"https://en.wikipedia.org/wiki?curid=48687986","title":"Ponderosa Skatepark","body":""}
